; ModuleID = 'chess05ISO.pas'
source_filename = "C:\Users\lemo\work\compilers\lpc\test\chess05ISO.pas"
target datalayout = "e-m:w-i64:64-f80:128-n8:16:32:64-S128"


; line 0
;================================================================================
; scope: global scope (level : 0)

; types
%T_pointer_1 = type i8*
%T_text = type i8

; line 1
;================================================================================
; scope: program scope (level : 1)

; types
%T_SX = type i8
%T_array_2 = type [2 x %T_SX]
%T_array_3 = type [2 x i32]
%T_RS = type [8 x i8]
%T_arraytmofrs = type [3 x %T_RS]
%T_arraytkofrs = type [17 x %T_RS]
%T_arraytfofrs = type [8 x %T_RS]
%T_TW = type i8
%T_arraytkoftw = type [17 x %T_TW]
%T_arraytpofte = type [13 x i32]
%T_arraytqofrs = type [4 x %T_RS]
%T_arraytrofrs = type [8 x %T_RS]
%T_RX = type [64 x %T_RS]
%T_TT = type i8
%T_SQ = type i8
%T_RC = type [64 x i32]
%T_array_5 = type [8 x i32]
%T_array_4 = type [8 x %T_array_5]
%T_RB = type [285 x i8]
%T_TV = type i8
%T_array_6 = type [20 x %T_TV]
%T_array_7 = type [16 x %T_RS]
%T_array_8 = type [8 x i32]
%T_RJ = type [74 x i8]
%T_array_9 = type [18 x %T_TW]
%T_TJ = type i8
%T_TK = type i8
%T_TS = type i8
%T_RM = type [48 x i8]
%T_array_10 = type [17 x %T_RM]
%T_array_11 = type [3 x i32]
%T_array_12 = type [17 x %T_TV]
%T_RF = type [500 x %T_RM]
%T_RN = type [30 x i8]
%T_array_13 = type [17 x i32]
%T_array_14 = type [3 x i32]
%T_RA = type [10 x i8]
%T_RD = type [5 x i8]

!0 = !DIFile(filename: "chess05ISO.pas", directory: "C:\Users\lemo\work\compilers\lpc\test")
!1 = !DIBasicType(name: "boolean", size: 8, encoding: DW_ATE_boolean)
!2 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!3 = !DIBasicType(name: "integer", size: 32, encoding: DW_ATE_signed)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: 0, baseType: !5, size: 64)
!5 = !DIBasicType(name: "void", size: 0)
!6 = !DIBasicType(name: "real", size: 64, encoding: DW_ATE_float)
!7 = !DIBasicType(name: "void", size: 0)
!8 = !DICompositeType(tag: DW_TAG_array_type, name: "arraytmofrs", file: !0, line: 146, baseType: !9, size: 192, elements: !21)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RS", file: !0, line: 129, size: 64, flags: DIFlagTypePassByValue, elements: !19)
!10 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 131, baseType: !11, size: 16, elements: !13)
!11 = !DIBasicType(name: "void", size: 0)
!12 = !DISubrange(count: 2)
!13 = !{!12}
!14 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 132, baseType: !3, size: 64, elements: !16)
!15 = !DISubrange(count: 2)
!16 = !{!15}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "RSSS", scope: !9, file: !0, line: 131, baseType: !10, size: 16, offset: 0)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "RSTI", scope: !9, file: !0, line: 132, baseType: !14, size: 64, offset: 0)
!19 = !{!17,!18}
!20 = !DISubrange(count: 3)
!21 = !{!20}
!22 = !DICompositeType(tag: DW_TAG_array_type, name: "arraytkofrs", file: !0, line: 147, baseType: !9, size: 1088, elements: !24)
!23 = !DISubrange(count: 17)
!24 = !{!23}
!25 = !DICompositeType(tag: DW_TAG_array_type, name: "arraytfofrs", file: !0, line: 150, baseType: !9, size: 512, elements: !27)
!26 = !DISubrange(count: 8)
!27 = !{!26}
!28 = !DICompositeType(tag: DW_TAG_array_type, name: "arraytkoftw", file: !0, line: 148, baseType: !29, size: 136, elements: !31)
!29 = !DIBasicType(name: "void", size: 0)
!30 = !DISubrange(count: 17)
!31 = !{!30}
!32 = !DICompositeType(tag: DW_TAG_array_type, name: "arraytpofte", file: !0, line: 149, baseType: !33, size: 416, elements: !35)
!33 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!34 = !DISubrange(count: 13)
!35 = !{!34}
!36 = !DICompositeType(tag: DW_TAG_array_type, name: "arraytqofrs", file: !0, line: 152, baseType: !9, size: 256, elements: !38)
!37 = !DISubrange(count: 4)
!38 = !{!37}
!39 = !DICompositeType(tag: DW_TAG_array_type, name: "arraytrofrs", file: !0, line: 151, baseType: !9, size: 512, elements: !41)
!40 = !DISubrange(count: 8)
!41 = !{!40}
!42 = !DICompositeType(tag: DW_TAG_array_type, name: "RX", file: !0, line: 135, baseType: !9, size: 4096, elements: !44)
!43 = !DISubrange(count: 64)
!44 = !{!43}
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RB", file: !0, line: 82, size: 2304, flags: DIFlagTypePassByValue, elements: !65)
!46 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!47 = !DIBasicType(name: "void", size: 0)
!48 = !DIBasicType(name: "void", size: 0)
!49 = !DICompositeType(tag: DW_TAG_array_type, name: "RC", file: !0, line: 81, baseType: !50, size: 2048, elements: !52)
!50 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!51 = !DISubrange(count: 64)
!52 = !{!51}
!53 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 89, baseType: !54, size: 2048, elements: !58)
!54 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 89, baseType: !50, size: 256, elements: !56)
!55 = !DISubrange(count: 8)
!56 = !{!55}
!57 = !DISubrange(count: 8)
!58 = !{!57}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "RBTM", scope: !45, file: !0, line: 83, baseType: !46, size: 32, offset: 0)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "RBTS", scope: !45, file: !0, line: 84, baseType: !47, size: 8, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "RBTI", scope: !45, file: !0, line: 85, baseType: !3, size: 32, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "RBSQ", scope: !45, file: !0, line: 86, baseType: !48, size: 8, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "RBIS", scope: !45, file: !0, line: 88, baseType: !49, size: 2048, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "RBIRF", scope: !45, file: !0, line: 89, baseType: !53, size: 2048, offset: 128)
!65 = !{!59,!60,!61,!62,!63,!64}
!66 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 168, baseType: !67, size: 160, elements: !69)
!67 = !DIBasicType(name: "void", size: 0)
!68 = !DISubrange(count: 20)
!69 = !{!68}
!70 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!71 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!72 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 280, baseType: !9, size: 1024, elements: !74)
!73 = !DISubrange(count: 16)
!74 = !{!73}
!75 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!76 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 199, baseType: !3, size: 256, elements: !78)
!77 = !DISubrange(count: 8)
!78 = !{!77}
!79 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!80 = !DICompositeType(tag: DW_TAG_array_type, name: "RJ", file: !0, line: 94, baseType: !2, size: 592, elements: !82)
!81 = !DISubrange(count: 74)
!82 = !{!81}
!83 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 176, baseType: !29, size: 144, elements: !85)
!84 = !DISubrange(count: 18)
!85 = !{!84}
!86 = !DIBasicType(name: "void", size: 0)
!87 = !DIBasicType(name: "void", size: 0)
!88 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 177, baseType: !89, size: 6528, elements: !108)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RM", file: !0, line: 110, size: 384, flags: DIFlagTypePassByValue, elements: !106)
!90 = !DIBasicType(name: "void", size: 0)
!91 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "RMFR", scope: !89, file: !0, line: 111, baseType: !90, size: 8, offset: 0)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "RMTO", scope: !89, file: !0, line: 112, baseType: !90, size: 8, offset: 8)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "RMCP", scope: !89, file: !0, line: 113, baseType: !50, size: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "RMCA", scope: !89, file: !0, line: 114, baseType: !1, size: 8, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "RMAC", scope: !89, file: !0, line: 115, baseType: !1, size: 8, offset: 72)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "RMCH", scope: !89, file: !0, line: 116, baseType: !1, size: 8, offset: 80)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "RMMT", scope: !89, file: !0, line: 117, baseType: !1, size: 8, offset: 88)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "RMIL", scope: !89, file: !0, line: 118, baseType: !1, size: 8, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "RMSU", scope: !89, file: !0, line: 119, baseType: !1, size: 8, offset: 104)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "RMPR", scope: !89, file: !0, line: 120, baseType: !1, size: 8, offset: 112)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "RMOO", scope: !89, file: !0, line: 122, baseType: !1, size: 8, offset: 120)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "RMEP", scope: !89, file: !0, line: 123, baseType: !1, size: 8, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "RMQS", scope: !89, file: !0, line: 124, baseType: !1, size: 8, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "RMPP", scope: !89, file: !0, line: 126, baseType: !91, size: 32, offset: 128)
!106 = !{!92,!93,!94,!95,!96,!97,!98,!99,!100,!101,!102,!103,!104,!105}
!107 = !DISubrange(count: 17)
!108 = !{!107}
!109 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 184, baseType: !3, size: 96, elements: !111)
!110 = !DISubrange(count: 3)
!111 = !{!110}
!112 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 174, baseType: !67, size: 136, elements: !114)
!113 = !DISubrange(count: 17)
!114 = !{!113}
!115 = !DICompositeType(tag: DW_TAG_array_type, name: "RF", file: !0, line: 144, baseType: !89, size: 192000, elements: !117)
!116 = !DISubrange(count: 500)
!117 = !{!116}
!118 = !DICompositeType(tag: DW_TAG_array_type, name: "RN", file: !0, line: 93, baseType: !2, size: 240, elements: !120)
!119 = !DISubrange(count: 30)
!120 = !{!119}
!121 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 175, baseType: !3, size: 544, elements: !123)
!122 = !DISubrange(count: 17)
!123 = !{!122}
!124 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 283, baseType: !46, size: 96, elements: !126)
!125 = !DISubrange(count: 3)
!126 = !{!125}
!127 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!128 = !DICompositeType(tag: DW_TAG_array_type, name: "RA", file: !0, line: 92, baseType: !2, size: 80, elements: !130)
!129 = !DISubrange(count: 10)
!130 = !{!129}
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RD", file: !0, line: 95, size: 40, flags: DIFlagTypePassByValue, elements: !137)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "RDPC", scope: !131, file: !0, line: 97, baseType: !1, size: 8, offset: 0)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "RDSL", scope: !131, file: !0, line: 98, baseType: !1, size: 8, offset: 8)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "RDKQ", scope: !131, file: !0, line: 99, baseType: !1, size: 8, offset: 16)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "RDNB", scope: !131, file: !0, line: 100, baseType: !1, size: 8, offset: 24)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "RDRK", scope: !131, file: !0, line: 101, baseType: !1, size: 8, offset: 32)
!137 = !{!132,!133,!134,!135,!136}
!138 = !DICompositeType(tag: DW_TAG_array_type, name: "RE", file: !0, line: 143, baseType: !67, size: 4000, elements: !140)
!139 = !DISubrange(count: 500)
!140 = !{!139}
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RY", file: !0, line: 137, size: 88, flags: DIFlagTypePassByValue, elements: !145)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "RYLS", scope: !141, file: !0, line: 138, baseType: !131, size: 40, offset: 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "RYCH", scope: !141, file: !0, line: 139, baseType: !2, size: 8, offset: 40)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "RYRS", scope: !141, file: !0, line: 140, baseType: !131, size: 40, offset: 48)
!145 = !{!142,!143,!144}
!146 = !DIBasicType(name: "void", size: 0)
!147 = !DIBasicType(name: "void", size: 0)
!148 = !DIBasicType(name: "void", size: 0)
!149 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 179, baseType: !79, size: 544, elements: !151)
!150 = !DISubrange(count: 17)
!151 = !{!150}
!152 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 284, baseType: !141, size: 4136, elements: !154)
!153 = !DISubrange(count: 47)
!154 = !{!153}
!155 = !DIBasicType(name: "void", size: 0)
!156 = !DIBasicType(name: "void", size: 0)
!157 = !DIBasicType(name: "void", size: 0)
!158 = !DIBasicType(name: "void", size: 0)
!159 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 162, baseType: !9, size: 832, elements: !161)
!160 = !DISubrange(count: 13)
!161 = !{!160}
!162 = !DIBasicType(name: "void", size: 0)
!163 = !DIBasicType(name: "void", size: 0)
!164 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 237, baseType: !156, size: 1912, elements: !166)
!165 = !DISubrange(count: 239)
!166 = !{!165}
!167 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 245, baseType: !89, size: 1536, elements: !169)
!168 = !DISubrange(count: 4)
!169 = !{!168}
!170 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 235, baseType: !1, size: 104, elements: !172)
!171 = !DISubrange(count: 13)
!172 = !{!171}
!173 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 247, baseType: !11, size: 512, elements: !175)
!174 = !DISubrange(count: 64)
!175 = !{!174}
!176 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 248, baseType: !2, size: 16, elements: !178)
!177 = !DISubrange(count: 2)
!178 = !{!177}
!179 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 249, baseType: !156, size: 128, elements: !181)
!180 = !DISubrange(count: 16)
!181 = !{!180}
!182 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 251, baseType: !2, size: 32, elements: !184)
!183 = !DISubrange(count: 4)
!184 = !{!183}
!185 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 252, baseType: !186, size: 384, elements: !190)
!186 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 252, baseType: !50, size: 96, elements: !188)
!187 = !DISubrange(count: 3)
!188 = !{!187}
!189 = !DISubrange(count: 4)
!190 = !{!189}
!191 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 254, baseType: !47, size: 960, elements: !193)
!192 = !DISubrange(count: 120)
!193 = !{!192}
!194 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 255, baseType: !128, size: 240, elements: !196)
!195 = !DISubrange(count: 3)
!196 = !{!195}
!197 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 256, baseType: !70, size: 96, elements: !199)
!198 = !DISubrange(count: 3)
!199 = !{!198}
!200 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 257, baseType: !67, size: 24, elements: !202)
!201 = !DISubrange(count: 3)
!202 = !{!201}
!203 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 258, baseType: !2, size: 104, elements: !205)
!204 = !DISubrange(count: 13)
!205 = !{!204}
!206 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 259, baseType: !46, size: 416, elements: !208)
!207 = !DISubrange(count: 13)
!208 = !{!207}
!209 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 260, baseType: !71, size: 416, elements: !211)
!210 = !DISubrange(count: 13)
!211 = !{!210}
!212 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 261, baseType: !67, size: 104, elements: !214)
!213 = !DISubrange(count: 13)
!214 = !{!213}
!215 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 262, baseType: !128, size: 320, elements: !217)
!216 = !DISubrange(count: 4)
!217 = !{!216}
!218 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 263, baseType: !90, size: 32, elements: !220)
!219 = !DISubrange(count: 4)
!220 = !{!219}
