
; line 0
;================================================================================
; scope: global scope (level : 0)

; types
%T_pointer_1 = type i8*
%T_text = type __file

; line 1
;================================================================================
; scope: program scope (level : 1)

; types
%T_arraytmofrs = type __array
%T_arraytkofrs = type __array
%T_arraytfofrs = type __array
%T_arraytkoftw = type __array
%T_arraytpofte = type __array
%T_arraytqofrs = type __array
%T_arraytrofrs = type __array
%T_RX = type __array
%T_TT = type __range
%T_SQ = type __set
%T_RC = type __array
%T_array_2 = type __array
%T_RB = type [27 x i8]
%T_array_3 = type __array
%T_array_4 = type __array
%T_array_5 = type __array
%T_RS = type [1 x i8]
%T_array_6 = type __array
%T_array_7 = type __array
%T_RJ = type __array
%T_array_8 = type __array
%T_TJ = type __range
%T_TK = type __range
%T_TW = type __range
%T_array_9 = type __array
%T_TS = type __range
%T_RM = type [48 x i8]
%T_TV = type __range
%T_array_10 = type __array
%T_array_11 = type __array
%T_RF = type __array
%T_RN = type __array
%T_array_12 = type __array
%T_array_13 = type __array
%T_RA = type __array
%T_RD = type [5 x i8]
%T_RE = type __array
%T_RY = type [11 x i8]
%T_SC = type __set
%T_SF = type __set
%T_SR = type __set
%T_array_14 = type __array
%T_SX = type __set
%T_array_15 = type __array
%T_TA = type __range
%T_TD = type __range
%T_TL = type __range
%T_TN = type __range
%T_array_16 = type __array

!0 = !DIFile(filename: "chess05ISO.pas", checksumkind: CSK_None)
!1 = !DIBasicType(name: "boolean", size: 8, encoding: DW_ATE_boolean)
!2 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!3 = !DIBasicType(name: "integer", size: 32, encoding: DW_ATE_signed)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: -1, baseType: !5, size: 64)
!5 = !DIBasicType(name: "void", size: 0, encoding: DW_ATE_void)
!6 = !DIBasicType(name: "real", size: 64, encoding: DW_ATE_float)
!7 = TODO
!8 = TODO
!9 = TODO
!10 = TODO
!11 = TODO
!12 = TODO
!13 = TODO
!14 = TODO
!15 = TODO
!16 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RB", file: !0, line: 82, size: 224, flags: DIFlagTypePassByValue, elements: !29)
!18 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!19 = TODO
!20 = TODO
!21 = TODO
!22 = TODO
!23 = !DIDerivedType(tag: DW_TAG_member, name: "RBTM", scope: !17, file: !0, line: 83, baseType: !18, size: 32, offset: 0)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "RBTS", scope: !17, file: !0, line: 84, baseType: !19, size: 8, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "RBTI", scope: !17, file: !0, line: 85, baseType: !3, size: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "RBSQ", scope: !17, file: !0, line: 86, baseType: !20, size: 8, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "RBIS", scope: !17, file: !0, line: 88, baseType: !21, size: 8, offset: 104)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "RBIRF", scope: !17, file: !0, line: 89, baseType: !22, size: 8, offset: 104)
!29 = !{!23,!24,!25,!26,!27,!28}
!30 = TODO
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RS", file: !0, line: 129, size: 8, flags: DIFlagTypePassByValue, elements: !36)
!32 = TODO
!33 = TODO
!34 = !DIDerivedType(tag: DW_TAG_member, name: "RSSS", scope: !31, file: !0, line: 131, baseType: !32, size: 8, offset: 0)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "RSTI", scope: !31, file: !0, line: 132, baseType: !33, size: 8, offset: 0)
!36 = !{!34,!35}
!37 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!38 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!39 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!40 = TODO
!41 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!42 = TODO
!43 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!44 = TODO
!45 = TODO
!46 = TODO
!47 = TODO
!48 = TODO
!49 = TODO
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RM", file: !0, line: 110, size: 384, flags: DIFlagTypePassByValue, elements: !67)
!51 = TODO
!52 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "RMFR", scope: !50, file: !0, line: 111, baseType: !51, size: 8, offset: 0)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "RMTO", scope: !50, file: !0, line: 112, baseType: !51, size: 8, offset: 8)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "RMCP", scope: !50, file: !0, line: 113, baseType: !37, size: 32, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "RMCA", scope: !50, file: !0, line: 114, baseType: !1, size: 8, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "RMAC", scope: !50, file: !0, line: 115, baseType: !1, size: 8, offset: 72)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "RMCH", scope: !50, file: !0, line: 116, baseType: !1, size: 8, offset: 80)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "RMMT", scope: !50, file: !0, line: 117, baseType: !1, size: 8, offset: 88)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "RMIL", scope: !50, file: !0, line: 118, baseType: !1, size: 8, offset: 96)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "RMSU", scope: !50, file: !0, line: 119, baseType: !1, size: 8, offset: 104)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "RMPR", scope: !50, file: !0, line: 120, baseType: !1, size: 8, offset: 112)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "RMOO", scope: !50, file: !0, line: 122, baseType: !1, size: 8, offset: 120)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "RMEP", scope: !50, file: !0, line: 123, baseType: !1, size: 8, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "RMQS", scope: !50, file: !0, line: 124, baseType: !1, size: 8, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "RMPP", scope: !50, file: !0, line: 126, baseType: !52, size: 32, offset: 128)
!67 = !{!53,!54,!55,!56,!57,!58,!59,!60,!61,!62,!63,!64,!65,!66}
!68 = TODO
!69 = TODO
!70 = TODO
!71 = TODO
!72 = TODO
!73 = TODO
!74 = TODO
!75 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!76 = TODO
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RD", file: !0, line: 95, size: 40, flags: DIFlagTypePassByValue, elements: !83)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "RDPC", scope: !77, file: !0, line: 97, baseType: !1, size: 8, offset: 0)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "RDSL", scope: !77, file: !0, line: 98, baseType: !1, size: 8, offset: 8)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "RDKQ", scope: !77, file: !0, line: 99, baseType: !1, size: 8, offset: 16)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "RDNB", scope: !77, file: !0, line: 100, baseType: !1, size: 8, offset: 24)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "RDRK", scope: !77, file: !0, line: 101, baseType: !1, size: 8, offset: 32)
!83 = !{!78,!79,!80,!81,!82}
!84 = TODO
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RY", file: !0, line: 137, size: 88, flags: DIFlagTypePassByValue, elements: !89)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "RYLS", scope: !85, file: !0, line: 138, baseType: !77, size: 40, offset: 0)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "RYCH", scope: !85, file: !0, line: 139, baseType: !2, size: 8, offset: 40)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "RYRS", scope: !85, file: !0, line: 140, baseType: !77, size: 40, offset: 48)
!89 = !{!86,!87,!88}
!90 = TODO
!91 = TODO
!92 = TODO
!93 = TODO
!94 = TODO
!95 = TODO
!96 = TODO
!97 = TODO
!98 = TODO
!99 = TODO
!100 = TODO
!101 = TODO
!102 = TODO
!103 = TODO
!104 = TODO
!105 = TODO
!106 = TODO
!107 = TODO
!108 = TODO
!109 = TODO
!110 = TODO
!111 = TODO
!112 = TODO
!113 = TODO
!114 = TODO
!115 = TODO
!116 = TODO
!117 = TODO
!118 = TODO
!119 = TODO
!120 = TODO
!121 = TODO
!122 = TODO
!123 = TODO
!124 = TODO
!125 = TODO
!126 = TODO
!127 = TODO
!128 = TODO
!129 = TODO
!130 = TODO
!131 = TODO
!132 = !{!1,!2,!3,!4,!5,!6,!7,!8,!9,!10,!11,!12,!13,!14,!15,!16,!17,!18,!19,!20,!21,!22,!30,!31,!32,!33,!37,!38,!39,!40,!41,!42,!43,!44,!45,!46,!47,!48,!49,!50,!51,!52,!68,!69,!70,!71,!72,!73,!74,!75,!76,!77,!84,!85,!90,!91,!92,!93,!94,!95,!96,!97,!98,!99,!100,!101,!102,!103,!104,!105,!106,!107,!108,!109,!110,!111,!112,!113,!114,!115,!116,!117,!118,!119,!120,!121,!122,!123,!124,!125,!126,!127,!128,!129,!130,!131}
!133 = !{}
!134 = !{}
!135 = !{!"LPC 1.1 (debug) - built on Mar 19 2020"}
!136 = distinct !DICompileUnit(language: DW_LANG_Pascal83, file: !0, producer: "LPC 1.1 (debug) - built on Mar 19 2020", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133, retainedTypes: !132, globals: !134, nameTableKind: None)

