
; line 0
;================================================================================
; scope: global scope (level : 0)

; types
%T_pointer_1 = type i8*
%T_text = type __file

; line 71
;================================================================================
; scope: program scope (level : 1)

; types
%T_array_2 = type __array
%T_arri = type __array
%T_arrr = type __array
%T_esub = type __range
%T_subr = type __range
%T_string10 = type __array
%T_recs = type [5 x i8]
%T_cset = type __set
%T_iptr = type i32*
%T_rec = type [48 x i8]
%T_arrim = type __array
%T_array_3 = type __array
%T_array_4 = type __array
%T_array_5 = type __array
%T_array_6 = type __array
%T_array_7 = type __array
%T_array_8 = type __array
%T_array_9 = type __array
%T_array_10 = type __array
%T_array_11 = type __array
%T_array_12 = type __array
%T_array_13 = type __array
%T_array_14 = type __array
%T_array_15 = type __array
%T_array_16 = type __array
%T_array_17 = type __array
%T_set_18 = type __set
%T_set_19 = type __set
%T_set_20 = type __set
%T_set_21 = type __set
%T_array_22 = type __array
%T_array_23 = type __array
%T_array_24 = type __array
%T_file_25 = type __file
%T_file_26 = type __file
%T_text_27 = type __file
%T_file_28 = type __file
%T_file_29 = type __file
%T_file_30 = type __file
%T_file_31 = type __file
%T_file_32 = type __file
%T_file_33 = type __file
%T_file_35 = type __file
%T_file_36 = type __file
%T_file_37 = type __file
%T_array_38 = type __array
%T_pointer_39 = type i32*

!0 = !DIFile(filename: "iso7185pat.pas", checksumkind: CSK_None)
!1 = !DIBasicType(name: "boolean", size: 8, encoding: DW_ATE_boolean)
!2 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!3 = !DIBasicType(name: "integer", size: 32, encoding: DW_ATE_signed)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: -1, baseType: !5, size: 64)
!5 = !DIBasicType(name: "void", size: 0, encoding: DW_ATE_void)
!6 = !DIBasicType(name: "real", size: 64, encoding: DW_ATE_float)
!7 = TODO
!8 = TODO
!9 = TODO
!10 = TODO
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rec", file: !0, line: 106, size: 384, flags: DIFlagTypePassByValue, elements: !34)
!12 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!13 = TODO
!14 = TODO
!15 = TODO
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "recs", file: !0, line: 100, size: 64, flags: DIFlagTypePassByValue, elements: !19)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !16, file: !0, line: 102, baseType: !3, size: 32, offset: 0)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !16, file: !0, line: 103, baseType: !2, size: 8, offset: 32)
!19 = !{!17,!18}
!20 = TODO
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "iptr", file: !0, line: 99, baseType: !3, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !11, file: !0, line: 108, baseType: !3, size: 32, offset: 0)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !11, file: !0, line: 109, baseType: !1, size: 8, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !11, file: !0, line: 110, baseType: !2, size: 8, offset: 40)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !11, file: !0, line: 111, baseType: !12, size: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "es", scope: !11, file: !0, line: 112, baseType: !13, size: 8, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !11, file: !0, line: 113, baseType: !14, size: 8, offset: 104)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !11, file: !0, line: 114, baseType: !6, size: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !11, file: !0, line: 115, baseType: !15, size: 8, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !11, file: !0, line: 116, baseType: !9, size: 8, offset: 200)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !11, file: !0, line: 117, baseType: !16, size: 64, offset: 224)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "stc", scope: !11, file: !0, line: 118, baseType: !20, size: 8, offset: 288)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !11, file: !0, line: 119, baseType: !21, size: 64, offset: 320)
!34 = !{!22,!23,!24,!25,!26,!27,!28,!29,!30,!31,!32,!33}
!35 = TODO
!36 = TODO
!37 = TODO
!38 = TODO
!39 = TODO
!40 = TODO
!41 = TODO
!42 = TODO
!43 = TODO
!44 = TODO
!45 = TODO
!46 = TODO
!47 = TODO
!48 = TODO
!49 = TODO
!50 = TODO
!51 = TODO
!52 = TODO
!53 = TODO
!54 = TODO
!55 = TODO
!56 = TODO
!57 = TODO
!58 = TODO
!59 = TODO
!60 = TODO
!61 = TODO
!62 = TODO
!63 = TODO
!64 = TODO
!65 = TODO
!66 = TODO
!67 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!68 = TODO
!69 = TODO
!70 = TODO
!71 = TODO
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: 389, baseType: !3, size: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 300, size: 320, flags: DIFlagTypePassByValue, elements: !111)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 303, size: 288, flags: DIFlagTypePassByValue, elements: !108)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 306, size: 256, flags: DIFlagTypePassByValue, elements: !105)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 309, size: 224, flags: DIFlagTypePassByValue, elements: !102)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 312, size: 192, flags: DIFlagTypePassByValue, elements: !99)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 315, size: 160, flags: DIFlagTypePassByValue, elements: !96)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 318, size: 128, flags: DIFlagTypePassByValue, elements: !93)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 321, size: 96, flags: DIFlagTypePassByValue, elements: !90)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 324, size: 64, flags: DIFlagTypePassByValue, elements: !87)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 327, size: 32, flags: DIFlagTypePassByValue, elements: !84)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !82, file: !0, line: 329, baseType: !3, size: 32, offset: 0)
!84 = !{!83}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !81, file: !0, line: 326, baseType: !3, size: 32, offset: 0)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !81, file: !0, line: 327, baseType: !82, size: 32, offset: 32)
!87 = !{!85,!86}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !80, file: !0, line: 323, baseType: !3, size: 32, offset: 0)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !80, file: !0, line: 324, baseType: !81, size: 64, offset: 32)
!90 = !{!88,!89}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !79, file: !0, line: 320, baseType: !3, size: 32, offset: 0)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !79, file: !0, line: 321, baseType: !80, size: 96, offset: 32)
!93 = !{!91,!92}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !78, file: !0, line: 317, baseType: !3, size: 32, offset: 0)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !78, file: !0, line: 318, baseType: !79, size: 128, offset: 32)
!96 = !{!94,!95}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !77, file: !0, line: 314, baseType: !3, size: 32, offset: 0)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !77, file: !0, line: 315, baseType: !78, size: 160, offset: 32)
!99 = !{!97,!98}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !76, file: !0, line: 311, baseType: !3, size: 32, offset: 0)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !76, file: !0, line: 312, baseType: !77, size: 192, offset: 32)
!102 = !{!100,!101}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !75, file: !0, line: 308, baseType: !3, size: 32, offset: 0)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !75, file: !0, line: 309, baseType: !76, size: 224, offset: 32)
!105 = !{!103,!104}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !74, file: !0, line: 305, baseType: !3, size: 32, offset: 0)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !74, file: !0, line: 306, baseType: !75, size: 256, offset: 32)
!108 = !{!106,!107}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !73, file: !0, line: 302, baseType: !3, size: 32, offset: 0)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !73, file: !0, line: 303, baseType: !74, size: 288, offset: 32)
!111 = !{!109,!110}
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prec", file: !0, line: 122, size: 384, flags: DIFlagTypePassByValue, elements: !125)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !112, file: !0, line: 124, baseType: !3, size: 32, offset: 0)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !112, file: !0, line: 125, baseType: !1, size: 8, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !112, file: !0, line: 126, baseType: !2, size: 8, offset: 40)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !112, file: !0, line: 127, baseType: !12, size: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "es", scope: !112, file: !0, line: 128, baseType: !13, size: 8, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !112, file: !0, line: 129, baseType: !14, size: 8, offset: 104)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !112, file: !0, line: 130, baseType: !6, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !112, file: !0, line: 131, baseType: !15, size: 8, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !112, file: !0, line: 132, baseType: !9, size: 8, offset: 200)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !112, file: !0, line: 133, baseType: !16, size: 64, offset: 224)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "stc", scope: !112, file: !0, line: 134, baseType: !20, size: 8, offset: 288)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !112, file: !0, line: 135, baseType: !21, size: 64, offset: 320)
!125 = !{!113,!114,!115,!116,!117,!118,!119,!120,!121,!122,!123,!124}
!126 = TODO
!127 = TODO
!128 = TODO
!129 = TODO
!130 = TODO
!131 = TODO
!132 = TODO
!133 = TODO
!134 = TODO
!135 = TODO
!136 = TODO
!137 = TODO
!138 = TODO
!139 = TODO
!140 = TODO
!141 = TODO
!142 = TODO
!143 = TODO
!144 = TODO
!145 = TODO
!146 = TODO
!147 = TODO
!148 = TODO
!149 = TODO
!150 = TODO
!151 = TODO
!152 = TODO
!153 = TODO
!154 = TODO
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: 396, baseType: !3, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: 385, baseType: !9, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: 378, baseType: !1, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: 379, baseType: !2, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: 380, baseType: !12, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: 381, baseType: !13, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: 377, baseType: !3, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: 388, baseType: !21, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: 383, baseType: !6, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: 386, baseType: !16, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: 382, baseType: !14, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: 384, baseType: !15, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: 387, baseType: !20, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 159, size: 128, flags: DIFlagTypePassByValue, elements: !175)
!169 = TODO
!170 = !DIDerivedType(tag: DW_TAG_member, name: "rx", scope: !168, file: !0, line: 161, baseType: !3, size: 32, offset: 0)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !168, file: !0, line: 162, baseType: !2, size: 8, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ry", scope: !168, file: !0, line: 163, baseType: !3, size: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !168, file: !0, line: 164, baseType: !1, size: 8, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !168, file: !0, line: 165, baseType: !169, size: 8, offset: 104)
!175 = !{!170,!171,!172,!173,!174}
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 395, size: 16, flags: DIFlagTypePassByValue, elements: !178)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "rcastt", scope: !176, file: !0, line: 395, baseType: !1, size: 8, offset: 0)
!178 = !{!177}
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "recv", file: !0, line: 138, size: 160, flags: DIFlagTypePassByValue, elements: !185)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !179, file: !0, line: 140, baseType: !3, size: 32, offset: 0)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !179, file: !0, line: 141, baseType: !2, size: 8, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !179, file: !0, line: 142, baseType: !1, size: 8, offset: 40)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !179, file: !0, line: 144, baseType: !15, size: 8, offset: 48)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !179, file: !0, line: 145, baseType: !12, size: 32, offset: 64)
!185 = !{!180,!181,!182,!183,!184}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: 350, baseType: !11, size: 64)
!187 = TODO
!188 = TODO
!189 = TODO
!190 = TODO
!191 = TODO
!192 = TODO
!193 = TODO
!194 = TODO
!195 = TODO
!196 = TODO
!197 = TODO
!198 = TODO
!199 = TODO
!200 = TODO
!201 = TODO
!202 = TODO
!203 = TODO
!204 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!205 = TODO
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 239, size: 256, flags: DIFlagTypePassByValue, elements: !233)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !206, file: !0, line: 241, baseType: !3, size: 32, offset: 0)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "vt", scope: !206, file: !0, line: 242, baseType: !204, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "vdi", scope: !206, file: !0, line: 244, baseType: !3, size: 32, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !206, file: !0, line: 244, baseType: !3, size: 32, offset: 96)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "vdb", scope: !206, file: !0, line: 245, baseType: !1, size: 8, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !206, file: !0, line: 245, baseType: !3, size: 32, offset: 96)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "vdc", scope: !206, file: !0, line: 246, baseType: !2, size: 8, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !206, file: !0, line: 246, baseType: !3, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "vde", scope: !206, file: !0, line: 247, baseType: !12, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !206, file: !0, line: 247, baseType: !3, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "vdes", scope: !206, file: !0, line: 248, baseType: !13, size: 8, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !206, file: !0, line: 248, baseType: !3, size: 32, offset: 96)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "vds", scope: !206, file: !0, line: 249, baseType: !14, size: 8, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !206, file: !0, line: 249, baseType: !3, size: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "vdr", scope: !206, file: !0, line: 250, baseType: !6, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !206, file: !0, line: 250, baseType: !3, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "vdst", scope: !206, file: !0, line: 251, baseType: !15, size: 8, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !206, file: !0, line: 251, baseType: !3, size: 32, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "vda", scope: !206, file: !0, line: 252, baseType: !9, size: 8, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !206, file: !0, line: 252, baseType: !3, size: 32, offset: 96)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "vdrc", scope: !206, file: !0, line: 253, baseType: !16, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !206, file: !0, line: 253, baseType: !3, size: 32, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "vdstc", scope: !206, file: !0, line: 254, baseType: !20, size: 8, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !206, file: !0, line: 254, baseType: !3, size: 32, offset: 96)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "vdp", scope: !206, file: !0, line: 255, baseType: !21, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !206, file: !0, line: 255, baseType: !3, size: 32, offset: 128)
!233 = !{!207,!208,!209,!210,!211,!212,!213,!214,!215,!216,!217,!218,!219,!220,!221,!222,!223,!224,!225,!226,!227,!228,!229,!230,!231,!232}
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 270, size: 96, flags: DIFlagTypePassByValue, elements: !238)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "vt", scope: !234, file: !0, line: 272, baseType: !1, size: 8, offset: 0)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "vi", scope: !234, file: !0, line: 274, baseType: !3, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "vb", scope: !234, file: !0, line: 275, baseType: !1, size: 8, offset: 8)
!238 = !{!235,!236,!237}
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 280, size: 96, flags: DIFlagTypePassByValue, elements: !243)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "vt", scope: !239, file: !0, line: 282, baseType: !12, size: 32, offset: 0)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "vi", scope: !239, file: !0, line: 284, baseType: !3, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "vb", scope: !239, file: !0, line: 285, baseType: !1, size: 8, offset: 32)
!243 = !{!240,!241,!242}
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 290, size: 96, flags: DIFlagTypePassByValue, elements: !248)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "vt", scope: !244, file: !0, line: 292, baseType: !13, size: 8, offset: 0)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "vi", scope: !244, file: !0, line: 294, baseType: !3, size: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "vb", scope: !244, file: !0, line: 295, baseType: !1, size: 8, offset: 8)
!248 = !{!245,!246,!247}
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 260, size: 96, flags: DIFlagTypePassByValue, elements: !253)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "vt", scope: !249, file: !0, line: 262, baseType: !14, size: 8, offset: 0)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "vi", scope: !249, file: !0, line: 264, baseType: !3, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "vb", scope: !249, file: !0, line: 265, baseType: !1, size: 8, offset: 8)
!253 = !{!250,!251,!252}
!254 = TODO
!255 = TODO
!256 = TODO
!257 = TODO
!258 = TODO
!259 = TODO
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "pt", file: !0, line: 580, baseType: !2, size: 64)
!261 = !{!1,!2,!3,!4,!5,!6,!7,!8,!9,!10,!11,!12,!13,!14,!15,!16,!20,!21,!35,!36,!37,!38,!39,!40,!41,!42,!43,!44,!45,!46,!47,!48,!49,!50,!51,!52,!53,!54,!55,!56,!57,!58,!59,!60,!61,!62,!63,!64,!65,!66,!67,!68,!69,!70,!71,!72,!73,!74,!75,!76,!77,!78,!79,!80,!81,!82,!112,!126,!127,!128,!129,!130,!131,!132,!133,!134,!135,!136,!137,!138,!139,!140,!141,!142,!143,!144,!145,!146,!147,!148,!149,!150,!151,!152,!153,!154,!155,!156,!157,!158,!159,!160,!161,!162,!163,!164,!165,!166,!167,!168,!169,!176,!179,!186,!187,!188,!189,!190,!191,!192,!193,!194,!195,!196,!197,!198,!199,!200,!201,!202,!203,!204,!205,!206,!234,!239,!244,!249,!254,!255,!256,!257,!258,!259,!260}
!262 = !{}
!263 = !{}
!264 = !{!"LPC 1.1 (debug) - built on Mar 19 2020"}
!265 = distinct !DICompileUnit(language: DW_LANG_Pascal83, file: !0, producer: "LPC 1.1 (debug) - built on Mar 19 2020", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !262, retainedTypes: !261, globals: !263, nameTableKind: None)

