; ModuleID = 'p5_pint.pas'
source_filename = "C:\Users\lemo\work\compilers\lpc\test\p5_pint.pas"
target datalayout = "e-m:w-i64:64-f80:128-n8:16:32:64-S128"

; runtime functions
declare dso_local i8* @_OpenFile(i32)
declare dso_local i8* @_OpenTempFile(i8*)
declare dso_local void @_CloseFile(i8*)
declare dso_local void @_WriteBool(i8*, i32, i32, i1)
declare dso_local void @_WriteChar(i8*, i32, i32, i8)
declare dso_local void @_WriteInteger(i8*, i32, i32, i32)
declare dso_local void @_WriteReal(i8*, i32, i32, double)
declare dso_local void @_WriteString(i8*, i32, i32, i8*, i32)
declare dso_local void @_WriteLn(i8*)

; program arguments (command line mapping)
%struct._Filename = type { i8*, i8* }
@_FilenameMapEntries = internal global [5 x %struct._Filename]
    [
    %struct._Filename { i8* getelementptr inbounds ([6 x i8], [6 x i8]* @.str.1, i32 0, i32 0), i8* null },
    %struct._Filename { i8* getelementptr inbounds ([7 x i8], [7 x i8]* @.str.2, i32 0, i32 0), i8* null },
    %struct._Filename { i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str.3, i32 0, i32 0), i8* null },
    %struct._Filename { i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str.4, i32 0, i32 0), i8* null },
    %struct._Filename { i8* null, i8* null }
    ], align 16
@_FilenameMap = dso_local global %struct._Filename* getelementptr inbounds ([5 x %struct._Filename], [5 x %struct._Filename]* @_FilenameMapEntries, i32 0, i32 0), align 8
@_FilenameMapSize = dso_local constant i32 4, align 4


!0 = !DIFile(filename: "p5_pint.pas", directory: "C:\Users\lemo\work\compilers\lpc\test")
!1 = !DIBasicType(name: "boolean", size: 8, encoding: DW_ATE_boolean)
!2 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!3 = !DIBasicType(name: "integer", size: 32, encoding: DW_ATE_signed)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: 0, baseType: !5, size: 64)
!5 = !DIBasicType(name: "void", size: 0)
!6 = !DIBasicType(name: "real", size: 64, encoding: DW_ATE_float)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "text", file: !0, line: 0, baseType: null, size: 64)
!8 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!9 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!10 = !DICompositeType(tag: DW_TAG_array_type, name: "alfa", file: !0, line: 433, baseType: !2, size: 80, elements: !12)
!11 = !DISubrange(count: 10)
!12 = !{!11}
!13 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!14 = !DICompositeType(tag: DW_TAG_array_type, name: "beta", file: !0, line: 430, baseType: !2, size: 200, elements: !16)
!15 = !DISubrange(count: 25)
!16 = !{!15}
!17 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 463, baseType: !18, size: 6400, elements: !21)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "bytfil", file: !0, line: 435, baseType: null, size: 64)
!19 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!20 = !DISubrange(count: 100)
!21 = !{!20}
!22 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!23 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 467, baseType: !1, size: 800, elements: !25)
!24 = !DISubrange(count: 100)
!25 = !{!24}
!26 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!27 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 465, baseType: !22, size: 3200, elements: !29)
!28 = !DISubrange(count: 100)
!29 = !{!28}
!30 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 461, baseType: !7, size: 6400, elements: !32)
!31 = !DISubrange(count: 100)
!32 = !{!31}
!33 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 457, baseType: !1, size: 2048, elements: !35)
!34 = !DISubrange(count: 256)
!35 = !{!34}
!36 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 458, baseType: !37, size: 8192, elements: !39)
!37 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!38 = !DISubrange(count: 256)
!39 = !{!38}
!40 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 455, baseType: !10, size: 20480, elements: !42)
!41 = !DISubrange(count: 256)
!42 = !{!41}
!43 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!44 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!45 = !DICompositeType(tag: DW_TAG_array_type, name: "settype", file: !0, line: 431, baseType: !48, size: 256, elements: !47)
!46 = !DISubrange(count: 256)
!47 = !{!46}
!48 = !DIBasicType(size: 1, encoding: DW_ATE_boolean)
!49 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 456, baseType: !10, size: 2960, elements: !51)
!50 = !DISubrange(count: 37)
!51 = !{!50}
!52 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 442, baseType: !19, size: 6400032, elements: !54)
!53 = !DISubrange(count: 200001)
!54 = !{!53}
!55 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 501, size: 128, flags: DIFlagTypePassByValue, elements: !62)
!57 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 504, baseType: !19, size: 128, elements: !59)
!58 = !DISubrange(count: 4)
!59 = !{!58}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !56, file: !0, line: 503, baseType: !3, size: 32, offset: 0)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !56, file: !0, line: 504, baseType: !57, size: 128, offset: 0)
!62 = !{!60,!61}
!63 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 519, size: 128, flags: DIFlagTypePassByValue, elements: !70)
!65 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 522, baseType: !19, size: 128, elements: !67)
!66 = !DISubrange(count: 4)
!67 = !{!66}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !64, file: !0, line: 521, baseType: !3, size: 32, offset: 0)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !64, file: !0, line: 522, baseType: !65, size: 128, offset: 0)
!70 = !{!68,!69}
!71 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 536, size: 256, flags: DIFlagTypePassByValue, elements: !78)
!73 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 539, baseType: !19, size: 256, elements: !75)
!74 = !DISubrange(count: 8)
!75 = !{!74}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !72, file: !0, line: 538, baseType: !6, size: 64, offset: 0)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !72, file: !0, line: 539, baseType: !73, size: 256, offset: 0)
!78 = !{!76,!77}
!79 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 553, size: 256, flags: DIFlagTypePassByValue, elements: !86)
!81 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 556, baseType: !19, size: 256, elements: !83)
!82 = !DISubrange(count: 8)
!83 = !{!82}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !80, file: !0, line: 555, baseType: !6, size: 64, offset: 0)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !80, file: !0, line: 556, baseType: !81, size: 256, offset: 0)
!86 = !{!84,!85}
!87 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 589, size: 1024, flags: DIFlagTypePassByValue, elements: !94)
!89 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 592, baseType: !19, size: 1024, elements: !91)
!90 = !DISubrange(count: 32)
!91 = !{!90}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !88, file: !0, line: 591, baseType: !45, size: 256, offset: 0)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !88, file: !0, line: 592, baseType: !89, size: 1024, offset: 0)
!94 = !{!92,!93}
!95 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 606, size: 1024, flags: DIFlagTypePassByValue, elements: !102)
!97 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 609, baseType: !19, size: 1024, elements: !99)
!98 = !DISubrange(count: 32)
!99 = !{!98}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !96, file: !0, line: 608, baseType: !45, size: 256, offset: 0)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !96, file: !0, line: 609, baseType: !97, size: 1024, offset: 0)
!102 = !{!100,!101}
!103 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 639, size: 128, flags: DIFlagTypePassByValue, elements: !110)
!105 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 642, baseType: !19, size: 128, elements: !107)
!106 = !DISubrange(count: 4)
!107 = !{!106}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !104, file: !0, line: 641, baseType: !8, size: 32, offset: 0)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !104, file: !0, line: 642, baseType: !105, size: 128, offset: 0)
!110 = !{!108,!109}
!111 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 656, size: 128, flags: DIFlagTypePassByValue, elements: !118)
!113 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 659, baseType: !19, size: 128, elements: !115)
!114 = !DISubrange(count: 4)
!115 = !{!114}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !112, file: !0, line: 658, baseType: !8, size: 32, offset: 0)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !112, file: !0, line: 659, baseType: !113, size: 128, offset: 0)
!118 = !{!116,!117}
!119 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!120 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 675, baseType: !19, size: 1024, elements: !122)
!121 = !DISubrange(count: 32)
!122 = !{!121}
!123 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "labelrec", file: !0, line: 810, size: 64, flags: DIFlagTypePassByValue, elements: !127)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !124, file: !0, line: 811, baseType: !8, size: 32, offset: 0)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !124, file: !0, line: 812, baseType: !123, size: 32, offset: 32)
!127 = !{!125,!126}
!128 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!129 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 815, baseType: !124, size: 320064, elements: !131)
!130 = !DISubrange(count: 5001)
!131 = !{!130}
!132 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 814, baseType: !2, size: 80, elements: !134)
!133 = !DISubrange(count: 10)
!134 = !{!133}
!135 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 1163, baseType: !2, size: 8000, elements: !137)
!136 = !DISubrange(count: 1000)
!137 = !{!136}
!138 = !{!1,!2,!3,!4,!5,!6,!7,!8,!9,!10,!13,!14,!17,!18,!19,!22,!23,!26,!27,!30,!33,!36,!37,!40,!43,!44,!45,!49,!52,!55,!56,!57,!63,!64,!65,!71,!72,!73,!79,!80,!81,!87,!88,!89,!95,!96,!97,!103,!104,!105,!111,!112,!113,!119,!120,!123,!124,!128,!129,!132,!135}
!139 = !{}
!140 = !{}
!141 = !{!"LPC 1.1"}
!142 = distinct !DICompileUnit(language: DW_LANG_Pascal83, file: !0, producer: "LPC 1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !139, retainedTypes: !138, globals: !140, nameTableKind: None)
!143 = !{i32 2, !"CodeView", i32 1}
!144 = !{i32 2, !"Debug Info Version", i32 3}

