; ModuleID = 'pint.pas'
source_filename = "C:\Users\lemo\work\compilers\lpc\test\pint.pas"
target datalayout = "e-m:w-i64:64-f80:128-n8:16:32:64-S128"

; runtime functions
declare dso_local i8* @_OpenFile(i32)
declare dso_local i8* @_OpenTempFile(i8*)
declare dso_local void @_CloseFile(i8*)
declare dso_local void @_WriteBool(i8*, i32, i32, i1)
declare dso_local void @_WriteChar(i8*, i32, i32, i8)
declare dso_local void @_WriteInteger(i8*, i32, i32, i32)
declare dso_local void @_WriteReal(i8*, i32, i32, double)
declare dso_local void @_WriteString(i8*, i32, i32, i8*, i32)
declare dso_local void @_WriteLn(i8*)

; program arguments (command line mapping)
%struct._Filename = type { i8*, i8* }
@_FilenameMapEntries = internal global [5 x %struct._Filename]
    [
    %struct._Filename { i8* getelementptr inbounds ([6 x i8], [6 x i8]* @.str.1, i32 0, i32 0), i8* null },
    %struct._Filename { i8* getelementptr inbounds ([7 x i8], [7 x i8]* @.str.2, i32 0, i32 0), i8* null },
    %struct._Filename { i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str.3, i32 0, i32 0), i8* null },
    %struct._Filename { i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str.4, i32 0, i32 0), i8* null },
    %struct._Filename { i8* null, i8* null }
    ], align 16
@_FilenameMap = dso_local global %struct._Filename* getelementptr inbounds ([5 x %struct._Filename], [5 x %struct._Filename]* @_FilenameMapEntries, i32 0, i32 0), align 8
@_FilenameMapSize = dso_local constant i32 4, align 4

; line 0

!0 = !DIFile(filename: "pint.pas", directory: "C:\Users\lemo\work\compilers\lpc\test")
!1 = !DIBasicType(name: "boolean", size: 8, encoding: DW_ATE_boolean)
!2 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!3 = !DIBasicType(name: "integer", size: 32, encoding: DW_ATE_signed)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: 0, baseType: !5, size: 64)
!5 = !DIBasicType(name: "void", size: 0)
!6 = !DIBasicType(name: "real", size: 64, encoding: DW_ATE_float)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "text", file: !0, line: 0, baseType: null, size: 64)
!8 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!9 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!10 = !DICompositeType(tag: DW_TAG_array_type, name: "alfa", file: !0, line: 76, baseType: !2, size: 80, elements: !12)
!11 = !DISubrange(count: 10)
!12 = !{!11}
!13 = !DICompositeType(tag: DW_TAG_array_type, name: "beta", file: !0, line: 74, baseType: !2, size: 200, elements: !15)
!14 = !DISubrange(count: 25)
!15 = !{!14}
!16 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!17 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!18 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!19 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 78, baseType: !20, size: 1660992, elements: !29)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 79, size: 192, flags: DIFlagTypePassByValue, elements: !27)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "op1", scope: !20, file: !0, line: 79, baseType: !18, size: 32, offset: 0)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !20, file: !0, line: 80, baseType: !17, size: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "q1", scope: !20, file: !0, line: 81, baseType: !16, size: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "op2", scope: !20, file: !0, line: 82, baseType: !18, size: 32, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "p2", scope: !20, file: !0, line: 83, baseType: !17, size: 32, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "q2", scope: !20, file: !0, line: 84, baseType: !16, size: 32, offset: 160)
!27 = !{!21,!22,!23,!24,!25,!26}
!28 = !DISubrange(count: 8651)
!29 = !{!28}
!30 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 112, baseType: !3, size: 4096, elements: !32)
!31 = !DISubrange(count: 128)
!32 = !{!31}
!33 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 111, baseType: !10, size: 10240, elements: !35)
!34 = !DISubrange(count: 128)
!35 = !{!34}
!36 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!37 = !DICompositeType(tag: DW_TAG_array_type, name: "settype", file: !0, line: 75, baseType: !40, size: 64, elements: !39)
!38 = !DISubrange(count: 59)
!39 = !{!38}
!40 = !DIBasicType(size: 1, encoding: DW_ATE_boolean)
!41 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 113, baseType: !10, size: 1680, elements: !43)
!42 = !DISubrange(count: 21)
!43 = !{!42}
!44 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 89, baseType: !45, size: 1152064, elements: !55)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !0, line: 90, size: 64, flags: DIFlagTypePassByValue, elements: !53)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "vi", scope: !45, file: !0, line: 93, baseType: !3, size: 32, offset: 0)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "vr", scope: !45, file: !0, line: 94, baseType: !6, size: 64, offset: 0)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "vb", scope: !45, file: !0, line: 95, baseType: !1, size: 8, offset: 0)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "vs", scope: !45, file: !0, line: 96, baseType: !37, size: 64, offset: 0)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "vc", scope: !45, file: !0, line: 97, baseType: !2, size: 8, offset: 0)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "va", scope: !45, file: !0, line: 98, baseType: !8, size: 32, offset: 0)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "vm", scope: !45, file: !0, line: 100, baseType: !3, size: 32, offset: 0)
!53 = !{!46,!47,!48,!49,!50,!51,!52}
!54 = !DISubrange(count: 18001)
!55 = !{!54}
!56 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "labelrec", file: !0, line: 128, size: 64, flags: DIFlagTypePassByValue, elements: !60)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !57, file: !0, line: 129, baseType: !8, size: 32, offset: 0)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !57, file: !0, line: 130, baseType: !56, size: 32, offset: 32)
!60 = !{!58,!59}
!61 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!62 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 135, baseType: !57, size: 118464, elements: !64)
!63 = !DISubrange(count: 1851)
!64 = !{!63}
!65 = !DICompositeType(tag: DW_TAG_array_type, file: !0, line: 134, baseType: !2, size: 80, elements: !67)
!66 = !DISubrange(count: 10)
!67 = !{!66}
!68 = !DIBasicType(name: "range", size: 32, encoding: DW_ATE_signed)
!69 = !{!1,!2,!3,!4,!5,!6,!7,!8,!9,!10,!13,!16,!17,!18,!19,!20,!30,!33,!36,!37,!41,!44,!45,!56,!57,!61,!62,!65,!68}
!70 = !{}
!71 = !{}
!72 = !{!"LPC 1.1"}
!73 = distinct !DICompileUnit(language: DW_LANG_Pascal83, file: !0, producer: "LPC 1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70, retainedTypes: !69, globals: !71, nameTableKind: None)
!74 = !{i32 2, !"CodeView", i32 1}
!75 = !{i32 2, !"Debug Info Version", i32 3}

