; ModuleID = 'prettyp.pas'
source_filename = "C:\Users\lemo\work\compilers\lpc\test\prettyp.pas"
target datalayout = "e-m:w-i64:64-f80:128-n8:16:32:64-S128"

; runtime functions
declare dso_local i8* @_OpenFile(i32)
declare dso_local i8* @_OpenTempFile(i8*)
declare dso_local void @_CloseFile(i8*)
declare dso_local void @_WriteBool(i8*, i32, i32, i1)
declare dso_local void @_WriteChar(i8*, i32, i32, i8)
declare dso_local void @_WriteInteger(i8*, i32, i32, i32)
declare dso_local void @_WriteReal(i8*, i32, i32, double)
declare dso_local void @_WriteString(i8*, i32, i32, i8*, i32)
declare dso_local void @_WriteLn(i8*)

; program arguments (command line mapping)
%struct._Filename = type { i8*, i8* }
@_FilenameMapEntries = internal global [5 x %struct._Filename]
    [
    %struct._Filename { i8* getelementptr inbounds ([7 x i8], [7 x i8]* @.str.1, i32 0, i32 0), i8* null },
    %struct._Filename { i8* getelementptr inbounds ([8 x i8], [8 x i8]* @.str.2, i32 0, i32 0), i8* null },
    %struct._Filename { i8* getelementptr inbounds ([10 x i8], [10 x i8]* @.str.3, i32 0, i32 0), i8* null },
    %struct._Filename { i8* getelementptr inbounds ([11 x i8], [11 x i8]* @.str.4, i32 0, i32 0), i8* null },
    %struct._Filename { i8* null, i8* null }
    ], align 16
@_FilenameMap = dso_local global %struct._Filename* getelementptr inbounds ([5 x %struct._Filename], [5 x %struct._Filename]* @_FilenameMapEntries, i32 0, i32 0), align 8
@_FilenameMapSize = dso_local constant i32 4, align 4


!0 = !DIFile(filename: "prettyp.pas", directory: "C:\Users\lemo\work\compilers\lpc\test")
!1 = !DIBasicType(name: "boolean", size: 8, encoding: DW_ATE_boolean)
!2 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!3 = !DIBasicType(name: "integer", size: 32, encoding: DW_ATE_signed)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, file: !0, line: 0, baseType: !5, size: 64)
!5 = !DIBasicType(name: "void", size: 0)
!6 = !DIBasicType(name: "real", size: 64, encoding: DW_ATE_float)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "text", file: !0, line: 0, baseType: null, size: 64)
!8 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!9 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!10 = !DIBasicType(name: "enum", size: 32, encoding: DW_ATE_signed)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CHARINFO", file: !0, line: 272, size: 64, flags: DIFlagTypePassByValue, elements: !14)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "NAME", scope: !11, file: !0, line: 273, baseType: !9, size: 32, offset: 0)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "VALUE", scope: !11, file: !0, line: 274, baseType: !2, size: 8, offset: 32)
!14 = !{!12,!13}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SYMBOLINFO", file: !0, line: 266, baseType: !16, size: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SYMBOL", file: !0, line: 258, size: 1728, flags: DIFlagTypePassByValue, elements: !25)
!17 = !DICompositeType(tag: DW_TAG_array_type, name: "STRING", file: !0, line: 256, baseType: !2, size: 1600, elements: !19)
!18 = !DISubrange(count: 200)
!19 = !{!18}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "NAME", scope: !16, file: !0, line: 259, baseType: !8, size: 32, offset: 0)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "VALUE", scope: !16, file: !0, line: 260, baseType: !17, size: 1600, offset: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "LENGTH", scope: !16, file: !0, line: 261, baseType: !3, size: 32, offset: 1632)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "SPACESBEFORE", scope: !16, file: !0, line: 262, baseType: !3, size: 32, offset: 1664)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "CRSBEFORE", scope: !16, file: !0, line: 263, baseType: !3, size: 32, offset: 1696)
!25 = !{!20,!21,!22,!23,!24}
!26 = !DICompositeType(tag: DW_TAG_array_type, name: "DBLCHARTABLE", file: !0, line: 251, baseType: !27, size: 32, elements: !31)
!27 = !DICompositeType(tag: DW_TAG_array_type, name: "SPECIALCHAR", file: !0, line: 247, baseType: !2, size: 16, elements: !29)
!28 = !DISubrange(count: 2)
!29 = !{!28}
!30 = !DISubrange(count: 2)
!31 = !{!30}
!32 = !DICompositeType(tag: DW_TAG_array_type, name: "DBLCHRSET", file: !0, line: 249, baseType: !35, size: 32, elements: !34)
!33 = !DISubrange(count: 24)
!34 = !{!33}
!35 = !DIBasicType(size: 1, encoding: DW_ATE_boolean)
!36 = !DICompositeType(tag: DW_TAG_array_type, name: "KEY", file: !0, line: 241, baseType: !2, size: 80, elements: !38)
!37 = !DISubrange(count: 10)
!38 = !{!37}
!39 = !DICompositeType(tag: DW_TAG_array_type, name: "KEYSYMSET", file: !0, line: 230, baseType: !42, size: 64, elements: !41)
!40 = !DISubrange(count: 33)
!41 = !{!40}
!42 = !DIBasicType(size: 1, encoding: DW_ATE_boolean)
!43 = !DICompositeType(tag: DW_TAG_array_type, name: "KEYWORDTABLE", file: !0, line: 244, baseType: !36, size: 1760, elements: !45)
!44 = !DISubrange(count: 22)
!45 = !{!44}
!46 = !DICompositeType(tag: DW_TAG_array_type, name: "OPTIONSET", file: !0, line: 228, baseType: !49, size: 32, elements: !48)
!47 = !DISubrange(count: 11)
!48 = !{!47}
!49 = !DIBasicType(size: 1, encoding: DW_ATE_boolean)
!50 = !DICompositeType(tag: DW_TAG_array_type, name: "OPTIONTABLE", file: !0, line: 238, baseType: !51, size: 5280, elements: !57)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TABLEENTRY", file: !0, line: 232, size: 160, flags: DIFlagTypePassByValue, elements: !55)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "OPTIONSSELECTED", scope: !51, file: !0, line: 233, baseType: !46, size: 32, offset: 0)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "DINDENTSYMBOLS", scope: !51, file: !0, line: 234, baseType: !39, size: 64, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "GOBBLETERMINATORS", scope: !51, file: !0, line: 235, baseType: !39, size: 64, offset: 96)
!55 = !{!52,!53,!54}
!56 = !DISubrange(count: 33)
!57 = !{!56}
!58 = !DICompositeType(tag: DW_TAG_array_type, name: "SGLCHARTABLE", file: !0, line: 253, baseType: !2, size: 48, elements: !60)
!59 = !DISubrange(count: 6)
!60 = !{!59}
!61 = !DICompositeType(tag: DW_TAG_array_type, name: "SYMBOLSTACK", file: !0, line: 283, baseType: !62, size: 6400, elements: !67)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "STACKENTRY", file: !0, line: 278, size: 64, flags: DIFlagTypePassByValue, elements: !65)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "INDENTSYMBOL", scope: !62, file: !0, line: 279, baseType: !8, size: 32, offset: 0)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "PREVMARGIN", scope: !62, file: !0, line: 280, baseType: !3, size: 32, offset: 32)
!65 = !{!63,!64}
!66 = !DISubrange(count: 100)
!67 = !{!66}
!68 = !{!1,!2,!3,!4,!5,!6,!7,!8,!9,!10,!11,!15,!16,!17,!26,!27,!32,!36,!39,!43,!46,!50,!51,!58,!61,!62}
!69 = !{}
!70 = !{}
!71 = !{!"LPC 1.1"}
!72 = distinct !DICompileUnit(language: DW_LANG_Pascal83, file: !0, producer: "LPC 1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !68, globals: !70, nameTableKind: None)
!73 = !{i32 2, !"CodeView", i32 1}
!74 = !{i32 2, !"Debug Info Version", i32 3}

